import 'package:flutter/material.dart';

class AgricultureLoansPage extends StatelessWidget {
  const AgricultureLoansPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(title: const Text('💰 القروض الفلاحية')),
      body: ListView(
        padding: const EdgeInsets.all(16),
        children: const [
          Text(
            '''هناك نوعان من القروض:

1. القرض الموسمي الرفيق R’FIG.
2. القرض الاستثماري التحدي ETTAHADI.

القرض الموسمي الرفيق: موجه للفلاحين وللمستثمرين وهذا حسب قانون التوجيه الفلاحي 2008 الفلاحين والمربين، سواء بشكل فردي أو منظم في تعاونيات أو مجموعات أو جمعيات أو اتحادات أو وحدات فلاحية أو مخزنون للمنتجات الزراعية ذات الاستهلاك الواسع.

القرض الاستثماري التحدي: موجه للفلاحين، وكذلك التعاونيات والمزارع النموذجية والمؤسسات الاقتصادية.
''',
            textAlign: TextAlign.right,
            style: TextStyle(fontSize: 18, fontWeight: FontWeight.bold),
          ),
          SizedBox(height: 16),
          ExpansionTile(
            title: Text('1️⃣ قرض الرفيق'),
            children: [
              Padding(
                padding: EdgeInsets.all(16),
                child: Text('''
        قرض الرفيق هو قرض موسمي مدعوم يمنحه بنك الفلاحة والتنمية الريفية Banque BADR يشتمل قرض الرفيق على القرض الموسمي والقرض الفيدرالي.

        المستفيدون من هذا القرض هم:
        - المزارعين والمربين، على شكل فرديً أوعلى شكل تعاونيات أو مجموعات أو رابطات أو اتحادات،
        - المزارع النموذجية،
        - المؤسسات الاقتصادية التي تسهم في تكثيف المنتجات الزراعية وتجهيزها واسترجاعها وتخزينها.

        خصائص قرض الرفيق:
        - هو قرض لمدة سنتين،
        - تتحمل وزارة الفلاحة والتنمية الريفية و الصيد البحري التغطية الكاملة للفائدة،
        - أي مستفيد من قرض الرفيق يسدد ما بين 6 و24 شهراً يستفيد من دفع جميع الفوائد من قبل وزارة الفلاحة وكدلك يستفيد من قرض آخر بنفس الصيغة للفترة التالية،
        - أي مستفيد من قرض الرفيق ولا يسدد في مدة السنتين، يفقد حق تسديد دفع الفائدة من قبل وزارة الفلاحة والتنمية الريفية والصيد البحري و يفقد حق الاستفادة من قرض آخر.

        المجالات التي يغطيها قرض الرفيق:

        **القرض الموسمي:**
        - اقتناء المدخلات اللازمة المتعلقة بنشاط المستثمرات الفلاحية (البذور، الشتلات، الأسمدة، مبيدات …)،
        - اقتناء أعلاف للحيوانات الموجهة للتربية و وسائل الري ومنتجات الأدوية البيطرية،
        - اقتناء المنتجات الفلاحية لتخزينها ضمن نظام ضبط المنتجات الفلاحية الواسعة الاستهلاك “SYRPALAC”،
        - عمليات زراعية،
        - حملة الحصاد والدرس.

        **القرض الفيدرالي:**
        القرض الفدرالي موجه للمتعاملين الاقتصاديين، المؤسسات الاقتصادية والتعاونيات والمجموعات المشاركة في الأنشطة التالية:
        - تحويل الطماطم الصناعية،
        - إنتاج الحليب،
        - إنتاج الحبوب،
        - إنتاج بذور البطاطس،
        - وحدات تصنيع العجائن (المعكرونة والكسكسي)،
        - تغليف وتصدير التمور،
        - إنتاج زيتون المائدة وزيت الزيتون،
        - إنتاج العسل،
        - إنتاج منتجات محلية "Produits du terroirs",
        - إنشاء وحدات الثروة الحيوانية ومراكز التسمين،
        - التلقيح الصناعي ونقل الأجنة،
        - ذبح وتقطيع الدواجن،
        - تسويق المنتجات الزراعية وتخزينها وتعبئتها وتثمينها،
        - إنتاج وتوزيع الأدوات الزراعية الصغيرة والري والبيوت البلاستيكية ….
        '''),
              ),
            ],
          ),
          ExpansionTile(
            title: Text('2️⃣ قرض التحدي'),
            children: [
              Padding(
                padding: EdgeInsets.all(16),
                child: Text('''
        إن قرض التحدي هو قرض استثماري محسّن، يمنح من قبل بنك بدر Banque BADR، (في إطار إنشاء مستثمرات جديدة للفلاحة وتربية الحيوانات على الأراضي الزراعية الغير مستغلة تابعة للمتعاملين الخواص أو الملكية الخاصة للدولة.

        يتم تغطية الفوائد المترتبة من قبل وزارة الفلاحة والتنمية الريفية والصيد البحري.

        الامتيازات المتعلقة عند الحصول على قرض التحدي:
        - إذا كانت مدة السداد خمس سنوات أو أقل، تتحمل الوزارة الفائدة،
        - يتحمل المستفيد من القرض دفع فائدة 1٪ عند السداد بين السنة السادسة (06) والسابعة (07)،
        - على المستفيد من القرض دفع فائدة 3٪ عند السداد من السنة الثامنة (08) والسنة التاسعة (09)،
        - إذا دام المشروع أكثر من عشر سنوات (10 سنوات)، يتحمل المستفيد أعباء الفوائد كاملة.

        المجالات التي يغطيها قرض التحدي:
        - إنشاء معدات وتحديث مستثمرات الفلاحة وتربية الحيوانات،
        - ﺗﻌزﯾز اﻟﻘدرات اﻹﻧﺗﺎﺟﯾﺔ للمستثمرات الحالية والغير مستغلة،
        - المؤسسات الاقتصادية التي تسهم في تكثيف المنتجات الزراعية والحيوانية وتصنيعها وتثمينها والتي تتطلب احتياجات تمويل متوسطة الأجل (قرض فدرالي).

        الإجراءات المؤهلة للحصول على قرض التحدي:
        - أشغال التحظير، التهيئة وحماية الأراضي،
        - عمليات تطوير الري الزراعي،
        - اقتناء عوامل ووسائل الإنتاج،
        - إنشاء البنية التحتية من تخزين، تحويل، تعبئة وتثمين الاسترداد،
        - حماية وتطوير التراث الجيني الحيواني والنباتي،
        - تطوير المنتوج الحرفي.
        '''),
              ),
            ],
          ),
        ],
      ),
    );
  }
}
