import 'package:flutter/material.dart';

class AgricultureStatsPage extends StatelessWidget {
  const AgricultureStatsPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('📈 الإحصائيات الفلاحية'),
        centerTitle: true,
      ),
      body: SingleChildScrollView(
        padding: const EdgeInsets.all(16),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            buildSection(
              title: 'الحبوب',
              description:
                  '''تحتل منتجات الحبوب مكانًا استراتيجيًا في النظام الغذائي وفي الاقتصاد الوطني. خلال الفترتين 2000-2009 و2010-2017 ، احتلت مساحة الحبوب معدل سنوي يبلغ 40٪ من المساحة الزراعية المفيدة .
تقدر المساحة المزروعة بالحبوب خلال العقد 2000-2009 بحوالي 3200930 هكتار ، حيث يشغل القمح الصلب والشعير معظم هذه المساحة ، بحوالي 74 ٪ من إجمالي مساحة الحبوب.
خلال الفترة 2010-2017 ، معدل هذه المساحة بلغ 3385560 هكتار ، بزيادة 6٪ مقارنة بالفترة السابقة (2000-2009 ).
ويقدر معدل إنتاج الحبوب خلال الفترة 2010-2017 بنحو 41.2 مليون قنطار ، بزيادة قدرها 26٪ مقارنة بعقد 2000-2009 حيث يقدر معدل الإنتاج 32.6 مليون قنطار.
وﻳﺘﻜﻮن اﻹﻧﺘﺎج أﺳﺎﺱﺎ ﻣﻦ اﻟﻘﻤﺢ الصلب واﻟﺸﻌﻴﺮ ، واﻟﺬي ﻳﻤﺜﻞ ﻋﻠﻰ اﻟﺘﻮاﻟﻲ 51٪ و 29٪ ﻣﻦ إجمالي معدل إنتاج الحبوب 2010–2017''',
              imagePaths: ['images/1A.jpg', 'images/2A.jpg'],
            ),
            buildSection(
              title: 'المحاصيل الصناعية',
              description:
                  '''ترتكز المحاصيل الصناعية على الطماطم الصناعية والتبغ بمعدل سنوي للمساحة وصل 19.380 هكتار خلال الفترتين 2000-2009 و2010-2017. بالنسبة للتبغ، بلغ معدل مساحته 4.850 هكتار خلال نفس الفترتين.
من حيث الإنتاج، ارتفع منتوج الطماطم الصناعية بشكل كبير، ب 136٪، ناتج عن تحسن المردود، والذي ارتفع من حوالي 200 كغ / هكتار خلال الفترة 2000-2009 إلى أكثر من 500 كغ / هكتار في فترة 2010-2017.''',
              imagePaths: ['images/3B.jpg', 'images/4B.jpg'],
            ),
            buildSection(
              title: 'الخضروات',
              description:
                  '''ارتفعت المساحة المخصصة للخضروات في السوق بنسبة + 44٪ خلال الفترة 2010-2017 مقارنة بالفترة السابقة 2000-2009.
كما زادت المساحات المخصصة للبطاطا والبصل بنسبة + 68٪ و + 35٪ على التوالي ، مقارنة بالفترة 2010-2017 و2002-2009.
زاد معدل انتاج الخضروات بشكل كبير خلال الفترة 2010-2017 ، حيث بلغ + 121٪ مقارنة بالفترة 2000-2009.
بالنسبة البطاطا والبصل اللذان يمثلان على التوالي أكثر من 36٪ وأكثر من 12٪ من إنتاج الخضروات فقد سجلا زيادة قدرها + 143٪ و + 102٪ على التوالي.
''',
              imagePaths: ['images/5.jpg'],
            ),
            buildSection(
              title: 'الأشجار المثمرة والكروم',
              description:
                  '''على مدى العقد 2000-2009، غطت بساتين الأشجار المثمرة معدل مساحة 396.480 هكتار ، 39 ٪ منها كانت مخصصة لبساتين الزيتون ، و 30 ٪ للأشجار المثمرة ، و 23 ٪ للنخيل و 8 ٪ للحمضيات.
وقد ازدادت هذه المساحة خلال الفترة 2010-2017 بنسبة 47٪ مقارنة بالعقد 2000-2009، حيث زادت مساحة شجرة الزيتون فيها بنسبة 58٪ ،و الأشجار المثمرة بنسبة 56٪ ، و 41٪ للحمضيات. 20٪ للنخيل.
ازدادت مستويات إنتاج شعب الأشجار المثمرة خلال الفترة 2010-2017 مقارنة بالعقد السابق (2000-2009) الذي يمثل:
– الأشجار المثمرة ذات البذور و ذات النواة 102٪
– الزيتون 99٪
– الحمضيات 91٪
 –التمور 82٪
كما تحسن إنتاج العنب بشكل كبير ، مع زيادة بنسبة 75 ٪ بين 2010-2017 و 2000-2009
''',
              imagePaths: ['images/6.jpg'], // صورة واحدة هنا
            ),
            buildSection(
              title: 'الماشية',
              description:
                  '''تمارس في الجزائر 5 أنواع رئيسية لتربية المواشي وهي: الأبقار والأغنام والماعز والإبل والخيول.
بلغ مجموع الرؤوس لجميع الأنواع خلال العقد 2000-2009 ، حوالي 24.5 مليون رأس ، وزاد هذا العدد إلى 33.6 مليون رأس خلال الفترة 2010-2017، بمعدل زيادة 37 ٪.
خلال فترة 2010-2017 ، تمثل الأغنام 78 ٪ من مجموع الماشية. 26.4 مليون رأس ، ويأتي الماعز في المرتبة الثانية (14٪) التي تمثل 4.8 مليون رأس ، تليها الأبقار ، التي تبلغ  1.9 مليون رأس (بما في ذلك الأبقار الحلوب بنسبة 52٪) ما يعادل 6٪ من مجموع المواشي.
تمثل أرقام الجمال والخيول على التوالي 1 ٪ و 0.5 ٪ من مجموع المواشي.
''',
              imagePaths: ['images/7.jpg'], // صورة واحدة هنا
            ),
            buildSection(
              title: 'الإنتاج الحيواني',
              description:
                  '''يقدر معدل إنتاج اللحوم الحمراء بنحو 4،7 مليون قنطار خلال فترة 2010-2017 ، بزيادة قدرها 55٪ مقارنة بالعقد السابق (3 ملايين قنطار).
ازدادت اللحوم البيضاء بشكل حاد خلال فترة 2010-2017 ، بمعدل نمو بلغ 109٪ خلال العقد 2000-2009.
يبلغ إنتاج بيض الاستهلاك سنويًا (2010-2017)5،7 مليار وحدة ، بمعدل نمو 76٪ خلال العقد الماضي.
بالنسبة للعسل ، زاد معدل انتاجه بشكل حاد ، من 25.000 قنطار من 2000 إلى 2009 إلى أكثر من 57.000 قنطار في فترة 2010-2017، أي بزيادة قدرها + 128 ٪.
خلال فترة 2010-2017، معدل جني صوف الغنم قدر بـ 334.970 قنطار مل يعادل 54٪ مقارنة بالعقد السابق.
''',
              imagePaths: ['images/8L.jpg', 'images/9L.jpg'], // صورة واحدة هنا
            ),
            buildSection(
              title: 'التوفر الغذائي',
              description:
                  '''التوفر الغذائي هو كمية الغذاء الموجودة فعليًا في بلد أو المنطقة ، بجميع أشكالها (الإنتاج الوطني ، الاحتياطيات ، الواردات التجارية ، …).
تحسّنت وفرة المنتجات الزراعية بشكل ملحوظ ، ولا سيما من أجل:
·        القمح (القمح الصلب والقمح اللين) بنسبة 29٪
·        البقوليات (39 ٪)
·        الخضروات (184 ٪)
·        البطاطا (235 ٪)
·        الحمضيات (115٪)
·        التمور (80 ٪)
·        الحليب (69 ٪)
·        اللحوم الحمراء (28 ٪)
·         اللحوم البيضاء (100٪)
·         البيض (162٪).
''',
            ),
            buildSection(
              title: 'القيمة المضافة الزراعية في الناتج المحلي الإجمالي',
              description:
                  '''يحتل قطاع الفلاحة المرتبة الثالثة بعد الخدمات والمحروقات، حيث ساهم بنسبة 12.3٪ من القيمة المضافة للناتج المحلي الإجمالي في عام 2016 ، بزيادة قدرها 1.2٪ عن عام 1999
''',
            ),
          ],
        ),
      ),
    );
  }

  Widget buildSection({
    required String title,
    required String description,
    List<String> imagePaths = const [], // استخدام قائمة للصور
  }) {
    return Card(
      margin: const EdgeInsets.only(bottom: 20),
      elevation: 4,
      shape: RoundedRectangleBorder(borderRadius: BorderRadius.circular(12)),
      child: Padding(
        padding: const EdgeInsets.all(16),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.start,
          children: [
            Text(
              title,
              style: const TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
            ),
            const SizedBox(height: 12),
            Text(
              description,
              style: const TextStyle(fontSize: 16),
              textAlign: TextAlign.justify,
            ),
            for (String imagePath in imagePaths) ...[
              const SizedBox(height: 12),
              ClipRRect(
                borderRadius: BorderRadius.circular(8),
                child: Image.asset(imagePath),
              ),
            ]
          ],
        ),
      ),
    );
  }
}
