import 'package:flutter/material.dart';

class DesertAgriculturePage extends StatelessWidget {
  const DesertAgriculturePage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(title: const Text('🌵 الزراعة الصحراوية')),
      body: ListView(
        padding: const EdgeInsets.all(16),
        children: const [
          ExpansionTile(
            title: Text('🌴 تنمية الزراعة الصحراوية',
                style: TextStyle(fontSize: 18, fontWeight: FontWeight.bold)),
            children: [
              Padding(
                padding: EdgeInsets.all(16.0),
                child: Text(
                  '''
تزخر مناطق الصحراء بموارد وإمكانات كبيرة قادرة على تلبية الاحتياجات الخاصة بها من حيث فرص العمل والاحتياجات الغذائية للسكان وتلعب دورًا مهمًا في تحسين الأمن الغذائي .

تتيح الظروف المناخية الزراعية في مناطق الأطلس الصحراوي ، والصحراء السفلى (بسكرة و الوادي) وحتى وسط الصحراء (ورقلة وغرداية) الفرصة لتطوير شعب الإنتاج غير الموسمية،حيث يمكن لهذه الشعب أت تعزز مصادر تزويد المراكز الحضرية الكبيرة في الشمال بالخضراوات ، بما في ذلك البطاطس.

وقد سمح وضع برامج مختلفة لتنمية المناطق الجنوبية من قبل الوزارة الوصية ، بتلبية الشروط اللازمة لتوفير فرص العمل وتحسين الظروف المعيشية ودخل سكان الريف.

و من بين  المؤشرات الرئيسية التي تبين أهمية الصحراء في  الاقتصاد الفلاحي الوطني، نذكر:

عشرة (10) ولايات صحراوية: أدرار ، بشار ، بسكرة ، الوادي، غرداية ، إليزي ، الأغواط ، ورقلة ، تمنراست وتندوف ؛

عدد البلديات: 188 بما في ذلك 141 منطقة ريفية

عشرة (10) مقاطعات إدارية: برج بادجي مختار وتميمون (أدرار) ، بني عباس (بشار) ، أولاد جلال (بسكرة) ، المغير (الواد) ، المنيعة (غرداية) ، جانيت (إليزي) ، تقرت (ورقلة) ، عين صلاح وعين  قزام( تمنراست)

أربعة عشر (14) منطقة طبيعية: الضاية، الزيبان، وادي ريغ و وادي ميزاب، القصور، ميزاب، ورقلة ، قورارة، الساورة، التوات، طاسيلي، تديكلت

 مساحة المنطقة: 18181839 هكتار ؛

طول الحزام الحدودي: 5000 كم.

إجمالي السكان النشطين: 1،203،725 نسمة ، من بينهم  465،177 فلاحين

1/الموارد الطبيعية

تبلغ المساحة القابلة للاستصلاح حوالي 1.4 مليون هكتار و تتوزع على المناطق الكبيرة التي كانت محل دراسات  في واحات النخيل القديمة في الوادي، رهير ، والتوات ، قوارارة و تيديكيلت  بالإضافة إلى المحيطات الجديدة قاسي الطويل ، حاسي – مسعود ، عين أمناس والعبادلة.
و تقدر الإمكانات القابلة للاستغلال في ما يخص الثروة المائية ا حسب النموذج العددي لنظام طبقات المياه الجوفية في الصحراء الشمالية (SASS) بنحو 6.1 مليار متر مكعب بحلول عام 2050.
أما الطاقات المتجددة ، فتتمثل في الطاقة الشمسية بقدرة 9 تيراواط ساعة / سنة ، و طاقة الرياح بقدرة  35 تيراواط ساعة / سنة والطاقة الحرارية الأرضية. طبقات المياه الدافئة (ALBIEN)
تسمح الإمكانات المتوفرة في المياه والتربة والطاقة  بالإضافة إلى توحيد المناطق الإنتاجية الحالية  بإنشاء مناطق جديدة تسمح ، على المدى المتوسط ​​، بزيادة  الإنتاج بنسبة 30٪ في يخص الخضراوات و الحبوب واللحوم الحمراء  و ذلك مقارنة بالمستويات المسجلة في السنوات الأخيرة.

تعتبر الفلاحة  النشاط الرئيسي  للسكان وعامل استقرار هم

1/  الأنشطة الفلاحية

على مدى العقد الماضي ، توسعت المساحة الفلاحية المروية (SAI) في الصحراء بأكثر من 106000 هكتار. لتبلغ حاليا  35911 هكتارًا ، وهو ما يمثل 30٪ من إجمالي المساحة المروية الوطنية ، و تتوزع  على مناطق  الزيبان ، ووادي ريغ ، والتوات ، وميزاب ، والسوف ، ورقلة.

زراعة النخيل  : تعتمد زراعة النخيل  على زراعة نخيل التمر (المكون من حوالي 1000 صنف) بسبب قدرتها على التكيف مع الظروف المناخية الصعبة التي تعتبر الركيزة الأساسية للنظام البيئي في الواحات. عرفت بساتين النخيل في الفترة (1960/1980) هجرا و إهمالا ما أدى إلى تراجع القدرات الإنتاجية  و شيخوخة  البساتين، غلا أنه تم استدراك الوضع بداية من 1980، حيث تم بعث نشاط زراعة النخيل  و  إحيائه بفضل الوسائل التي وفرتها السلطات العليا للبلاد.

يقدر ثروة شعبة النخيل  بحوالي 167،279 هكتار أي ما يعادل إنتاج 10،255،000 قنطار ، يتصدرها صنف دقلة نور بنسبة 53 ٪ ، و تنتج  التمور اساسا في الزيبان و السوف و ادي ريغ . و تحتل هذه المناطق  الريادة في إنتاج التمور صنفي الدقلة البيضاء والغرس ، في حين تشتهر قورارة و  و التوات بصنف تكربوشت.

على الرغم منقساوة المناخ الصحراوي ، فقد شهدت منطقة الصحراء الكبرى تطويرا كبيرا في مجال زراعة الحبوب التي تشغل أكثر من 81،900 هكتار ، خاصة في منطقتي الزيبان و جبال الضاية.

من بين المحاصيل الأخرى التي شهدت نمواً استثنائياً على مدار السنوات العشر الماضية ، محاصيل الخضروات التي تشغل حاليًا حوالي 92،736 هكتار ، منها 41٪  مخصص لإنتاج البطاطس. و تتوزع على مناطق التوات ، ووادي ريغ ، وميزاب ، السوف  و الزيبان. في حين تحتل زراعة الأشجار  المثمرة مساحة 21203 هكتار.  يتصدرها  الزيتون  الذي يحتل مساحة 800 10 هكتار ، وتليه أشجار المشمش والرمان، حيث تم جني محاصيل هامة في  منطقتي الزيبان وميزاب.

أما بالنسبة للمحاصيل الأخرى ، فقد تم تخصيص 19،196 هكتارًا لمحاصيل الأعلاف و 5225 هكتارًا المحاصيل الصناعية (التبغ ، الحناء ، الزعفران ، الطماطم).

أما تربية المواشي ، فتتصدرها تربية الأغنام بنسبة 69 ٪ ، وترتكز في مناطق قصور الضاية، و السوف والزيبان و هذا بالإضافة إلى تربية الإبل  الذي يعدالنشاط المميز  لولايات الجنوب بتعداد 339784 رأس  ، مايمثل إجمالي الثروة الوطنية.''',
                  textDirection: TextDirection.rtl,
                  style: TextStyle(fontSize: 16),
                ),
              )
            ],
          ),
          ExpansionTile(
            title: Text('⚡ برنامج الكهربة الزراعية',
                style: TextStyle(fontSize: 18, fontWeight: FontWeight.bold)),
            children: [
              Padding(
                padding: EdgeInsets.all(16.0),
                child: Text(
                  '''
 لم يحظ مجال الطاقة،  وخاصة الكهربة الزراعية، بأي برنامج يهدف إلى تطويره إلا  بحلول عام1995. حيث كان التزويد بالكهرباء لاستعمالات فلاحية يندرج ضمن عمليات البرنامج الكلاسيكي للكهربة الموجه لتلبية حاجيات المساكن إلى غاية عام 1988 ، أين تم تخصيص نسبة من 13 ٪ من هذا البرنامج سنويا للزراعة للإشراف على عمليات الحصول على ملكية الأراضي الفلاحية “APFA” و عمليات استصلاح الأراضي المعزولة.

وقد أسفر إلحاح الفلاحين على المستوى المحلي و إصرارهم على ضرورة التكفل بهذا الإجراء الهيكلي عن اتخاذ الحكومة لجملة من التدابير بغية إزالة القيود التي واجهت تنفيذ عمليات الاستصلاح الزراعي.

نحو تنشيط الكهربة الزراعية.

الطاقات المتجددة في الزراعة

تتمتع الجزائر بإمكانيات كبيرة لإنتاج جميع أنواع الطاقة المتجددة، إلا أنه لابد من تعزيز الجهود و توجيهها نحو تطوير هذا المورد الطبيعي البديل، مما سيسمح لها بتلبية الاحتياجات المسجلة بخصوص هذا المورد الحيوي و تغطية الطلب المتزايد على الطاقة.

نظرًا لموقعها الجغرافي، تمتلك الجزائر واحدة من أعلى الرواسب الشمسية في العالم. تتجاوز مدة أشعة الشمس على كامل الأراضي الوطنية حوالي 2000 ساعة سنويًا ويمكن أن تصل إلى 3900 ساعة في اللهضاب العليا والصحراء. وتبلغ الطاقة المتلقاة يوميًا على سطح أفقي قدره مليون متر مربع حوالي 5 كيلو واط في الساعة على معظم الأراضي الوطنية ، أي ما يقرب من 1700 كيلو واط ساعة / متر مربع سنويًا في الشمال و 2 263 كيلووات ساعة / متر مربع سنويًا في جنوب البلاد . كما ان متوسط ​​مدة أشعة الشمس في الجنوب هو 3500 ساعة في السنة.

أما فيما يتعلق بإمكانيات  طاقة الرياح ، تتمتع الجزائر بنظام ريح معتدلة (من 2 إلى 6 م / ث). و هي طاقة مناسبة تمامًا لضخ المياه ، خاصة في الهضاب العليا و الصحراء.

يهدف البرنامج الوطني لتطوير الطاقات المتجددة و الفعالية الطاقوية إلى تحقيق طاقة إنتاجية متجددة تتراح بين 47 إلى 51 تيراواط ساعة بحلول عام 2030 ، وهو ما يمثل 37 ٪ من السعة المركبة. و 27 ٪ من إنتاج الكهرباء المخصصة للاستهلاك الوطني. و تجدر الإشارة إلى أن 14 ولاية خاصة الجنوبية تتوفر على محطات للطاقة المتجددة بسعة 343 ميجاوات.

كما أن الجزائر التزمت باتخاذ بعض التدابير لتخفيف انبعاثات غازات الدفيئة (GHG)  بخصوص أهم الغازات الثلاثة من حيث الانبعاثات: ثاني أكسيد الكربون (CO2) ، والميثان ( CH4) وأكسيد النيتروز (N20) في الدورة الحادية والعشرين لمؤتمر الأطراف، و في هذا السياق تتواصل الجهود المبذولة للتوجه نحو استعمال و تطوير  الطاقات المتجددة  التي تعتبر البديل الأكثر جدية و الأنظف إيكولوجيا  والأكثر ربحًا تجاريًا

ومن هذا المنظور ، يتوجب على القطاع الفلاحي الاستمرار في الإنتاج دون تلويث البيئة ، وتعطيل النظم الإيكولوجية واستنفاد الموارد الأحفورية ، ما يقتضي اللجوء نحو استغلال الموارد الطبيعية والمتجددة  في برامج التنمية  الفلاحية والريفية .

لذا تتوافق استراتيجية  وزارة الفلاحة و التنمية الريفية و الصيد البحري المتعلقة بتعزيز وتطوير الطاقات الجديدة والمتجددة مع الاستراتيجية الوطنية ، التي يتم رفعها إلى مرتبة الأولوية الوطنية ؛ حيث أن خبرة القطاع في مجال ضخ المياه وإنتاج الكهرباء من الطاقة الشمسية لصالح الأسر الريفية رائدة ، ويعود تاريخها إلى أواخر السبعينيات ؛ و تهدف إلى ما يلي:

استبدال الطاقات المباشرة التقليدية بالطاقات المتجددة (كبديل) ؛
الحفاظ على الموارد المائية (الاقتصاد في استخدام الموارد المائية) ؛
كهربة التجمعات المتناثرة (محطة مصغرة للطاقة) ؛
وضع آليات للتحفيز على وجه الخصوص (الدعم) ؛
الاستعمال التدريجي للطاقات المتجددة على مستوى جميع القصور غير المكهربة ؛ و المناطق المعزولة (ري قطع الأراضي الزراعية الصغيرة) ؛ و المراعي من خلال تكثيف نقاط سقي الماشية بالمعدات ذات الصلة وكهربة الخيام) ؛و بساتين النخيل الهامشية الموجودة في المناطق شبه الصحراوية  والتي يجب الحفاظ عليها (كهربة المنازل).
تحسين الظروف المعيشية للسكان.
التخزين البارد للمنتجات المحلية المعرضة للتلف (الحليب والمشتقات واللحوم وغيرها)؛
 و سيسمح إنتاج الكهرباء من الطاقات المتجددة على مستوى المستثمرات الفلاحية (وخاصة الكتلة الحيوية والطاقة الحرارية الأرضية ، إلخ) ، بتعزيز  الشبكة الوطنية من خلال ضخ الطاقة المنتجة فيها   ما يعتبر تحفيزا لمنتجي هذه الطاقة ، بالإضافة إلى جملة التدابير و الحوافز المقدمة بموجب القانون المتعلق بإدارة الطاقة (المزايا المالية ، وما إلى ذلك) .''',
                  textDirection: TextDirection.rtl,
                  style: TextStyle(fontSize: 16),
                ),
              )
            ],
          ),
        ],
      ),
    );
  }
}
