import 'package:flutter/material.dart';

class InvestmentPromotionPage extends StatelessWidget {
  const InvestmentPromotionPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(title: const Text('🌱 ترقية الاستثمار')),
      body: ListView(
        padding: const EdgeInsets.all(16),
        children: const [
          ExpansionTile(
            title: Text(
                '1️⃣ الحصول على الأراضي الفلاحية عن طريق الاستصلاح في إطار الامتياز'),
            children: [
              Padding(
                padding: EdgeInsets.all(16),
                child: Text(
                  '''تطبيقًا لأحكام القانون رقم 08-16 الصادر في 03 أوت 2008 والمتعلق بالتوجيه الفلاحي، وفي إطار المبادئ التوجيهية التي أرستها الحكومة من أجل إدراج الفلاحة في صميم سياستنا الاقتصادية بهدف دعم الانتقال إلى نموذج تنموي جديد وإعداد المستقبل للأجيال المقبلة، باعتبار الفلاحة بذيل للمحروقات. تم منذ عام 2011 وضع آلية تسمح بالحصول على الأراضي الفلاحية، من خلال المنشور الوزاري المشترك رقم 108 المؤرخ 23 فيفري 2011 المتعلق بإنشاء المستثمرات المخصصة للفلاحة وتربية المواشي، والتي تم تعديله واستكماله بمنشور وزاري مشترك رقم 1839 المؤرخ 14 ديسمبر 2017 المتعلق بالحصول على الأراضي الفلاحية التابعة للأملاك الخاصة للدولة، والموجهة للاستثمار في مجال استصلاح الأراضي عن طريق الامتياز.

يعتبر المنشور الوزاري المشترك رقم 1839 بتاريخ 14/12/2017 (وزارة الموارد المائية، وزارة الفلاحة والتنمية الريفية والصيد البحري، وزارة المالية، ووزارة الداخلية والجماعات المحلية) المتعلق بالحصول على الأراضي الفلاحية التابعة للأملاك الخاصة للدولة، والموجهة للاستثمار في مجال استصلاح الأراضي عن طريق الامتياز، بمثابة مراجعة للمنشور الوزاري المشترك رقم 108 المؤرخ 23 فيفري 2011 الذي يهدف إلى ما يلي:
- إنشاء شباك موحد لوضع الملفات، أي مديرية المصالح الفلاحية للولاية.
- المصادقة على المشاريع الاستثمارية المهيكلة ذات طابع ابتكاري وقيمة مضافة عالية، من قبل اللجنة التوجيهية الولائية التي يرأسها الوالي.
- توسيع عضوية اللجنة التوجيهية الولائية لتشمل ممثلين آخرين مثل الوكالة الوطنية للموارد المائية وشركة توزيع الكهرباء والغاز، من أجل ضمان التمكين التقني للمشاريع الاستثمارية المعنية.
- إعادة تأهيل "وحدة التيسير" المنشأة بموجب المذكرة الوزارية رقم 66 المؤرخ 25 جانفي 2016.

أهداف المنشور الوزاري:
- تسهيل إجراءات الحصول على الأراضي الفلاحية.
- تشجيع الاستثمار من خلال الاستصلاح.
- تأمين ومرافقة للمستثمرين.
- استرجاع الأراضي غير المستغلة.
''',
                  textAlign: TextAlign.right,
                ),
              ),
            ],
          ),
          ExpansionTile(
            title: Text(
                '2️⃣ الحصول على الأراضي الفلاحية عن طريق الاستصلاح في إطار حيازة الملكية العقارية الفلاحية'),
            children: [
              Padding(
                padding: EdgeInsets.all(16),
                child: Text(
                  '''في إطار حيازة الملكية العقارية الفلاحية، تتم عملية رسم الحدود وتجسيدها من طرف السلطات المحلية بعد موافقة مديرية المصالح الفلاحية و كذا مصالح الموارد المائية. يتم تحديد قائمة المحيطات بقرار من الوالي، وتشمل جميع البلديات ويتم نشرها في مقر كل بلدية معنية. يمكن تحديد الموقع خارج المحيطات بمبادرة من المرشحين أو بمبادرة من الجماعات المحلية.

إجراءات المنح:
1. قيام المرشح بصياغة طلب خطي موجه إلى رئيس الدائرة، مصحوب بملف يتضمن:
   - تحديد موقع قطعة الأرض والمساحة المقدرة.
   - وضع برنامج استصلاح الأراضي.
   - تحديد قيمة الاستثمار المتوخى.
   - وضع مخطط مختصر للأراضي الواقعة خارج المحيط، ويودع الملف لدى أمانة اللجنة التقنية في محافظة الدائرة.
   
2. تتم معالجة الملف من قبل اللجنة التقنية في الدائرة، تصدر اللجنة رأيًا تقنيًا بشأن جدوى المشروع خلال فترة لا تتجاوز شهرًا (01).

3. يتم إرسال الملفات المرفقة بالإشعارات إلى البلدية من أجل المداولة.

4. نقل المداولة إلى والي للموافقة أو الرفض.

5. يقوم الفرع الولائي لديوان الوطني للأراضي الفلاحية بدعوة المرشحين المختارين للتوقيع على دفتر الشروط.

6. إصدار قرار تنازل يثبت صفة الملكية الملتمسة.
''',
                  textAlign: TextAlign.right,
                ),
              ),
            ],
          ),
          ExpansionTile(
            title: Text('3️⃣ استرجاع الأراضي غير المستغلة'),
            children: [
              Padding(
                padding: EdgeInsets.all(16),
                child: Text(
                  '''أضحى من غير المعقول ترك الأراضي الفلاحية أو تلك الصالحة للفلاحة غير مستغلة من طرف المستفيدين، أياً كانت الوضعية القانونية لهاته الأراضي سواء كانت خاصة أو تابعة للأملاك الخاصة لدولة وذلك بغض النظر عن طريقة استغلالها (حيازة الملكية العقارية الفلاحية، امتياز).

تنص الأحكام التشريعية والتنظيمية المعمول بها على إلزامية استغلال الأراضي، لاسيما المادة 20 من قانون 08-16 المؤرخ في 03/08/2008 المتعلق بالتوجيه الفلاحي، والتي تنص على أن الاستغلال الفعلي للأراضي الفلاحية واجب على أي مستثمر فلاحي أو شخص طبيعي أو اعتباري.

بالنسبة للأراضي الممنوحة في إطار الامتياز (مجلس وزاري مشترك رقم 1839):
- تتم متابعة تنفيذ عملية الاستصلاح عن طريق الامتياز من قبل لجنة متابعة، تم إنشاؤها بقرار من الوالي وتتألف من الممثلين المعتمدين لدى مديرية المصالح الفلاحية والديوان الوطني للأراضي الفلاحية.
- يتم اتخاذ إجراءات فسخ عقد الامتياز ضد المستفيدين الذين لم يلتزموا بالشروط المذكورة في دفتر الشروط.

بالنسبة للأراضي المخصصة بموجب مخطط حيازة الملكية العقارية الفلاحية APFA:
- في حالة غياب عملية استصلاح الأراضي لمدة خمسة سنوات (05)، يقوم الوالي و بطلب من رئيس البلدية بإبلاغ القاضي لغرض تطبيق شروط الفسخ.

يتم الإشراف على الاستصلاح وتوثيقه بشكل دوري من قبل لجان المراقبة التي تشرف على سير العمل وتقوم برفع تقارير توضح تقدم الأشغال وأية مشاكل قد تظهر خلال مراحل تنفيذ الاستصلاح.
''',
                  textAlign: TextAlign.right,
                ),
              ),
            ],
          ),
        ],
      ),
    );
  }
}
