import 'package:flutter/material.dart';

class MountainAgriculturePage extends StatelessWidget {
  const MountainAgriculturePage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(title: const Text('🏔️ الفلاحة في المناطق الجبلية')),
      body: ListView(
        padding: const EdgeInsets.all(16),
        children: const [
          Padding(
            padding: EdgeInsets.all(16.0),
            child: Text(
              '''تنمية الفلاحة في المناطق الجبلية

تكتسي المناطق الجبلية التي تمتد على طول الجزء الشمالي من البلاد وتحد سهول الهضاب العليا أهمية قصوى في التنمية الاجتماعية والاقتصادية، حيث تعتبر مناطق ذات قدرات عالية لابد من استغلالها بغية إعادة بعث بعض الأنشطة وإنشاء البنى التحتية القاعدية  التي من شأنها تعزيز الجاذبية الإقليمية و الإبقاء على الساكنة الريفية.

تتوزع المناطق الجبلية على 28 ولاية شمالية بتغطية كلية أو جزئية و  تشمل 453 بلدية ، أي 29 ٪ من المجموع الوطني ، وفقًا للمرسوم  الوزاري المشترك المؤرخ  في 16 ماي 1993 ، والذي يحدد المناطق الجبلية. كما أن هذه المناطق  تشغل مساحة فلاحية إجمالية  تقدر بـــ 2.53 مليون هكتار   أي ما يعادل 61 ٪ من إجمالي مساحة المناطق الجبلية،   و تتوفر على حوالي 1.7 مليون هكتار كمساحة زراعية مفيدة (أي 20 ٪ من مساحة الزراعية المفيدة).

 وتغطي الغابات والأحراش مساحة تزيد على 1.6 مليون هكتار فيما تغطي المراعي حوالي 519.988 هكتار،  و تأوي 639100 رأس من الأبقار و 2.660.000 رأس من الأغنام و723000 رأس من الماعز، كما تقدر طاقة إنتاج تربية الدواجن بـــها 67 مليون وحدة (منها 60 مليون وحدة موجهة لدجاج اللحم) وتعُدُّ تربية النحل 613000 خلية ممتلئة.

يمثل النشاط الزراعي ركيزة الكفاف الرئيسية للسكان الذين يعيشون في الجبال و المقدر تعدادهم بـــ 7 ملايين نسمة. (أي 17 ٪ من المجموع الوطني) من بينهم 3.5 مليون نسمة  يمثلون سكان الأرياف. فيما يقدر عدد السكان الناشطين في الزراعة  بـــــ63965 نسمة (أي 23 ٪ من إجمالي القوة العاملة).

تتنوع نظم الإنتاج الفلاحي في الجبال، و يغلب عليها الطابع الزراعي – الرعوي  الذي يتميز بالزراعة المختلطة المرتبطة بتربية الماشية واستغلال الموارد الغابية. و تم إحصاء 301900  مستثمرة فلاحية على مستوى المناطق الجبلية ، بقيمة إنتاجية قدرت     بـ 450 مليار دينار (عام 2014) ، مساهمة قدرها 16٪ في قيمة الإنتاج الفلاحي الوطني.

تشكل المناطق الجبلية بيئة اجتماعية-اقتصادية ديناميكية ذات إنتاجية عالية على مدار السنة ، تتسم بتنوع أنشطة الإنتاج المعيشية  و انسجام النشاط البشري مع هذه البيئة التي تجمع بين الأرض والمياه و الحياء النباتية والحيوانية. إلا أن هذه المناطق  أصبحت عرضة للإجهاد  البشري والبيئي  الذي يزيده حدة  الإفراط في استغلال الموارد والنزوح الجماعي للسكان نحو  المراكز الحضرية

العراقيل و العقبات التي تواجه الفلاحة الجبلية:

تصنيف الأراضي الفلاحية ، بصفة عامة ، ضمن وضع قانوني خاص ، ناتج عن الميراث العائلي، و تميزها بصغر المساحة التي نادراً ما تتجاوز 5 هكتارات ،  و التجزئة الكبيرة  و الانحدار الشديد ؛
اتباع نظام إنتاج مكثف موجه في أغلب الحالات نحو اقتصاد الكفاف ، والاستعمال المحدود لعوامل الإنتاج. و الاعتماد على اليد العاملة الأسرية ذات مهارات محدودة في المجال  ؛
زيادة الضغط البشري على الموارد الطبيعية (التربة والمياه والغطاء النباتي) بسبب عدم تنوع مصادر الدخل ، مما يؤدي إلى امتداد زراعة الحبوب الهامشية على الانحدارات الحادة للمنحدرات الهشة والرعي الجائر ، مما يؤدي إلى عملية تآكل التربة مما يهدد أنظمة الإنتاج الحالية  و المنشآت الهيدروليكية  المجاورة.
و أمام هذا الوضع ، ومن أجل تذليل الصعوبات و رفع العراقيل التي تعيق التنمية الفلاحية في المناطق الجبلية ، ارتأت السلطات العمومية إلى ضرورة الاهتمام الخاص ومضاعفة الجهود و  اتخاذ المبادرات الملموسة من أجل استدراك التأخر المسجل في المسار التنموي  وضمان التوازن الاجتماعي والاقتصادي.

تحقيقا لهذه الغاية ، شرع قطاع الفلاحة في تنفيذ العديد من برامج التنمية الموجهة لهذه المناطق ، حيث ثم تجسيد أكثر من 4000 مشروع جواري  ، وإعادة تشجير مساحة 210000 هكتار من الغابات، و غرس 100940 هكتار من الأشجار ، وفتح 116666 كم من المسارات ، وإنشاء 100800 مل من قنوات الري و السواقي ، و 1325 حوض لتخزين المياه ، فضلاً عن الإجراءات الأخرى للحفاظ على المياه و التربة ، ولا سيما معالجة الأخاديد  بحجم قدره 1403233 م3.

كما تجدر الإشارة إلى تنفيذ مشاريع للقوة العاملة الريفية (PER) ، ومشاريع رائدة لتنمية الفلاحة الجبلية التي تمت بالتعاون  مع الصندوق الدولي للتنمية الزراعية ، إضافة إلى المشاريع التي تقوم بتنفيذها الجمعيات بالشراكة مع المؤسسات الدولية . حيث تشكل هذه المشاريع رصيدا كبيرا  للتعليم والخبرات التي لابد من تثمينها  لتوجيه و تركيز إجراءات تنمية الفلاحة الجبلية في المستقبل.

و في هذا الإطار تم إنشاء فريق عمل مكلف باقتراح خارطة طريق لتوجيه الجهات الفاعلة الرئيسية ، وهي: المصالح الفلاحية ومحافظات الغابات و و الحظائر الوطنية والغرف الفلاحية والمعاهد المعنية والجمعيات  بهدف توحيد الإجراءات المنفذة ، واقتراح نهج  الاتساق بين السكان و الأرض من أجل تثمين المكتسبات الموجودة في هذه المناطق ، مع مراعاة الخصائص الإيكولوجية الزراعية والإمكانات الطبيعية المتوفرة.

ويهدف هذا النهج أيضًا إلى حماية الموارد الطبيعية وتحديث الأنشطة الفلاحية والابتكار في تنويع الإنتاج وتعزيزه وإزالة القيود التي تؤثر على استغلال العقار الفلاحي.

وقد تم  تقديم خارطة الطريق المذكورة  على النحو التالي:

إنشاء هيئة تشاور وتنسيق وتخطيط للأنشطة، “اللجنة المحلية” على مستوى كل ولاية جبلية من أجل تحقيق التنمية الفلاحية المتكاملة في المناطق الجبلية مما يسمح بإشراك جميع الجهات الفاعلة و المنتفعة : الإدارة والمهنة والسكان المستهدفين ؛
إنجاز تشخيص إقليمي تشاركي مع مراعاة خصوصيات المناطق وإمكاناتها ، والوسائل المتوفرة وقدرات السكان على الإنتاج مع الحفاظ على بيئتهم ؛
تثمين الإنجازات التي حققتها الدولة والحفاظ على أهميتها الاجتماعية والاقتصادية والبيئية ؛
تعزيز الإمكانات وتحديد مناطق الإنتاج.
تثمين المنتجات المحلية ذات القيمة المضافة العالية الخاصة بكل منطقة ؛
تنمية الإنتاج الحيواني، وخاصة عن طريق تحسين تربية الأبقار من السلالة المحلية وتشجيع مزارع الماعز والأغنام؛
تنمية الاقتصاد الغابي من خلال تثمين المنتجات الغابية والاستغلال الرشيد لها ، و تطوير أنشطة الفلاحة الغابية و الأنشطة التي تندرج ضمن المحيطات المعنية بترخيص الاستغلال من الأملاك الغابية الوطنية؛
تثمين نتائج البحث والتطوير من أجل تكييف الممارسات الثقافية مع الوسائل المحلية (البحث والتدريب والإرشاد)؛
تثمين وتعزيز رصيد الخبرات المكتسب في الحظائر الوطنية لصالح السكان المحليين ، من أجل ترقية النشاطات المرتبطة مباشرة بحماية الموارد الطبيعية و الحفاظ عليها، ولا سيما تطوير السياحة البيئية ؛
صياغة برامج تدريبية محددة ، تتكيف مع النشاط الفلاحي في المناطق الجبلية ، و تدعيمها بالإرشاد والمساعدة التقنية ؛
إدخال المعدات الفلاحية والطاقوية ، (الطاقة الشمسية وطاقة الرياح ) وتكييفها مع المناطق الجبلية ؛
مرافقة الفلاحين من أجل تنظيم أحسن في التعاونيات و / أو الجمعيات ، من أجل ترقية وتسويق المنتجات الفلاحية المحلية؛
حماية الموارد الطبيعية ، لا سيما حماية الأرض من التآكل وتحسين الظروف المعيشية للسكان من خلال الانشطة الهيكلية كفك العزلة ، والربط بشبكات الكهرباء و الغاز، وتعبئة الموارد المائية ؛
إنشاء وحدات صغيرة لتخزين وتجهيز وتعبئة المنتجات الفلاحية الجبلية والمنتجات الثانوية.
تثمين المهارات والممارسات المحلية والدراية وتشجيع المبادرات ؛
وبالنظر إلى التباينات المكانية للإقليم الوطني ، لابد من تحديد المبادئ التوجيهية للتنمية الفلاحية في المناطق الجبلية حسب المنطقة ، مع مراعاة إمكانات وخصائص كل منطقة ، وهذا من أجل تحقيق تنمية متناغمة بهدف حماية. وتنمية الموارد الطبيعية في سياق التنمية المستدامة.''',
              textAlign: TextAlign.justify,
              textDirection: TextDirection.rtl,
            ),
          ),
        ],
      ),
    );
  }
}
