import 'package:flutter/material.dart';

class ProductValorizationPage extends StatelessWidget {
  const ProductValorizationPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('تثمين المنتوجات الفلاحية'),
      ),
      body: ListView(
        children: const [
          ExpansionTile(
            title: Text('توسيم المنتوجات الفلاحية'),
            children: [
              Padding(
                padding: EdgeInsets.all(16.0),
                child: Text(
                  '''في ظل التحولات الاقتصادية التي تشهدها الساحة الوطنية، لاسيما تلك المتعلقة بفتح السوق أمام المنتوجات الخارجية، وتصديها للمنتوجات المحلية خاصة الفلاحية منها، أصبح من الضروري وضع “مؤشرات الجودة” التي تسمح لها بالتميز في الأسواق المحلية والدولية وحمايتها من أي استعمال مفرط، كون التوسيم وسيلة لاستغلال شهرة وخصوصيات منتوج من خلال ضمان المسار والنوعية للمستهلك وتوجيه اختياراته.

يعتبر التوسيم أو وضع العلامات المميزة المرتبطة بالأصل (البيان الجغرافي وتسمية المنشأ) عنصراً من عناصر التطوير الضرورية لتثمين المنتوجات الفلاحية وخاصة المحلية، وهو أداة مثالية للتمييز بينها وبين المنتوجات الأخرى، مما سمح بتقاسم المسؤولية بين:
- السلطات العامة
- المتعاملين الاقتصاديين
- المستهلكين

الهدف من التوسيم:
- تثمين المنتوجات الفلاحية وخاصة المحلية.
- ضمان جودة المنتوجات الفلاحية من خلال العلامات المميزة للجودة وتسمية المنشأ (AO) والتحديد الجغرافي (GI) أو الفلاحة البيولوجية (AB).
- السماح بالتنمية الاقتصادية للمنطقة.
- الحفاظ على المهارات التقليدية.

الإرساء التنظيمي:
ينص قانون التوجيه الفلاحي المؤرخ في 3 أوت 2008 في مادتيه 32 و 33 على ضرورة الأخذ بعين الاعتبار والتعرف على جودة المنتوجات الفلاحية أو تلك ذات الأصل الفلاحي وتعزيزها من خلال إعداد جهاز للجودة. وجاء المرسوم التنفيذي رقم 13-260 المؤرخ في 7 جويلية 2013 تطبيقاً لأحكام القانون المذكور أعلاه والذي يحدد قواعد التنظيم العام لجهاز التعرف على الجودة.''',
                  textAlign: TextAlign.right,
                ),
              ),
            ],
          ),
          ExpansionTile(
            title: Text('إجراءات'),
            children: [
              Padding(
                padding: EdgeInsets.all(16.0),
                child: Text(
                  '''جهاز التعرف على المنتوجات الفلاحية يعتمد على علامات التميز للجودة، وتسميات المنشأ (AO)، والتحديد الجغرافي (GI) من الآليات المهمة التي ترتكز عليها سياسة القطاع الفلاحي، نظراً لكونه وسيلة محفزة للتنمية الريفية يتم من خلالها تعزيز الديناميكيات المحلية وخلق فرص للعمل، وكذلك إعطاء قيمة مضافة للمنتوجات المحلية الأصيلة على مستوى الأسواق المحلية وفتح باب ولوج الأسواق الدولية.

انطلاقاً من قانون التوجيه الفلاحي رقم 08-16 المؤرخ في 3 أوت 2008 والذي يحدد نهج تثمين المنتوجات الفلاحية أو ذات الأصول الفلاحية، لا سيما في المادتين 32 و 33، جاء المرسوم التنفيذي رقم 13-260 المؤرخ في 7 جويلية 2013 تطبيقاً لأحكام قانون التوجيه الفلاحي المذكور أعلاه، الذي يحدد قواعد التنظيم العام لجهاز التعرف على المنتوجات الفلاحية.

يعتمد الجهاز المذكور أعلاه في وظيفته على لجنة وطنية لتوسيم، وأمانة دائمة، ولجان فرعية متخصصة وهيئات إصدار الشهادات، حيث تتمثل مهمتها الرئيسية في:
- الإعداد والمصادقة واللجوء حصرياً لتعريف المرجعي لمميزات المنتوج الفلاحي المعني وكذلك إجراءات مراقبة المطابقة.
- المصادقة على شهادة المنتوج الفلاحي ودفتر الشروط من قبل الهيئات المعنية بمنح الشهادات.
- الحق في إلصاق شعار يحمل علامة التميز على المنتوج.
- إسناد علامة التميز بقرار من وزارة الفلاحة والتنمية الريفية والصيد البحري الذي سيتم نشره في الجريدة الرسمية للجمهورية الجزائرية.
- تسجيل علامة التميز على مستوى المعهد الوطني الجزائري للملكية الفكرية (INAPI) فيما يخص الجانب المتعلق بحقوق الملكية الفكرية.''',
                  textAlign: TextAlign.right,
                ),
              ),
            ],
          ),
          ExpansionTile(
            title: Text('المراقبة و التصديق'),
            children: [
              Padding(
                padding: EdgeInsets.all(16.0),
                child: Text(
                  '''نظام المراقبة يركز أساسًا على جهاز التعرف على المنتوجات الفلاحية عن طريق علامات التميز للجودة، وتسميات المنشأ (AO)، والتحديد الجغرافي (IG). لا يمكن إصدار شهادات أو ضمان الفعالية والجودة دون تواجد هذا النظام.

وبالتالي، يضمن هذا النظام للفاعلين الاقتصاديين المشاركين في هذا المسعى احترام القواعد التي تم إعدادها في دفتر الشروط، كما يضمن للمستهلكين الجودة وأساليب الإنتاج التي ترتكز على توسيم المنتوج بتحديد أصله الجغرافي.

يوفر جهاز المراقبة ثلاثة مستويات من المراقبة:
1. الرقابة الذاتية من طرف المتعاملين الاقتصاديين على منتوجاتهم.
2. الرقابة الداخلية، من طرف المجموعات للمتعاملين الذين تم تحديدهم.
3. الرقابة الخارجية، من قبل طرف ثالث، هيئة التصديق، التي تعتبر رقابة مطابقة للمعايير الدولية.

تنص التنظيمات المعمول بها على أن هيئات التصديق هي هيئات خاصة ذات حقوق جزائرية يتم اختيارها وفقًا للمعايير الدولية لإصدار الشهادات للمنتوجات من قبل أطراف ثالثة. كما تستوجب الحصول على اعتماد من طرف الهيئة الجزائرية للاعتماد (ALGERAC) وموافقة من طرف وزير الفلاحة.

المعاهد التقنية المتخصصة في الرقابة:
- المعهد التقني للأشجار المثمرة والكرم ITAFV
- المعهد التقني للخضروات والمحاصيل الصناعية ITCMI
- المعهد التقني لتطوير الفلاحة الصحراوية ITDAS
- المعهد التقني لتربية المواشي ITELV
- المعهد التقني للمحاصيل الكبرى ITGC''',
                  textAlign: TextAlign.right,
                ),
              ),
            ],
          ),
        ],
      ),
    );
  }
}
