import 'package:flutter/material.dart';

class SupportMeasuresPage extends StatelessWidget {
  const SupportMeasuresPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(title: const Text('🛠️ إجراءات الدعم للشعب الفلاحية')),
      body: ListView(
        padding: const EdgeInsets.all(16),
        children: const [
          ExpansionTile(
            title: Text('الاجرائات'),
            children: [
              Padding(
                padding: EdgeInsets.all(16),
                child: Text(
                    '''أكدت الأزمات الغذائية الدولية التي شهدتها الأسواق الدولية في العقود الأخيرة ، بما في ذلك  أزمة 2007-2008 ، الطبيعة الحساسة لقضية الأمن الغذائي  و مدى ارتباطها الوثيق بالحفاظ على الأمن والسيادة الوطنيين.

حيث تضافرت جهود السلطات العليا للبلاد  في سبيل تعزيز  دعائم  تطوير القطاع الفلاحي و  تنميته ، ما جعلها تمضي قدما في تنفيذ قانون التوجيه الفلاحي لعام 2008.

و تأكيدا على الأهمية الإستراتيجية التي يكتسيها قطاع الفلاحة ، شدد رئيس الجمهورية على أن”الفلاحة يجب أن تصبح محركًا حقيقيًا للنمو الاقتصادي الشامل من خلال تكثيف الإنتاج بما في ذلك الشعب الزراعية –الغذائية  الإستراتيجية وأيضًا بفضل تعزيز التنمية المتكاملة لجميع المناطق الريفية “.

حيث تبلورت الرؤية الإستراتيجية لرئيس الجمهورية في ضرورة إرساء أسس السياسة الفلاحية للتقليل من مواطن الضعف وتشجيع ظهور حوكمة راشدة و رشيدة للفلاحة و الأقاليم الريفية  بإشراك جميع الأطراف الفاعلة، سواء العامة أو الخاصة ، و تمكينها.

و تم تحقيق هذه السياسة بشكل رئيسي من خلال مراجعة جهاز الدعم بناءً على المبادئ التالية:

إعادة توجيه الدعم نحو شعب الإنتاج الفلاحي ذات الأهمية الاستراتيجية من مكانتها في النظام الغذائي المحلي (الحبوب والبقول والحليب واللحوم … إلخ) ؛
الدعم الموجه نحو قنوات التجميع و سلاسل الإمدادات للشعب المختلفة (الحبوب ، الحليب ، البطاطس ، الطماطم الصناعية ، البذور والشتائل …) ؛
التبسيط العقلاني للدعم الممنوح للمدخلات الرئيسية للشعب الفلاحية (العجول ، الأسمدة ، المكننة الفلاحية ، معدات الري ..)
الأولوية المعطاة لحفظ وتطوير شعبة البذور والشتائل للإنتاج الحيواني والنباتي ؛
اختيار أهداف لدعم الاستثمار في المستثمرات الفلاحية مع مراعاة قدرات الرقابة والمتابعة للإدارة الفلاحية؛
تأمين دخل المزارعين و تثبيت استقرارها وحماية المستهلكين من خلال دعم إجراءات الضبط ( منح التخزين ، والأسعار المرجعية للتدخل ،) للشعب ذات القاعدة الاستهلاكية العريضة (الحبوب والحليب ، بطاطس،اللحوم،البصل)..
التدخل في المناطق الريفية المتكاملة والمتكيفة مع خصائص المناطق الإيكولوجية الزراعية (مكافحة التصحر وإدارة مستجمعات المياه …) ؛
التكفل باحتياجات الدعم و المرافقة لصغار الفلاحين و مربي الماشية من خلال برامج التجديد الريفي.
ويهدف تعديل أدوات التدخل وأساليب الدعم للتنمية الفلاحية والريفية إلى:

تشجيع بيئة محفزة وآمنة للفلاحين و المتعاملين الفاعلين في مجال الصناعات الزراعية-الغذائية ووضع سياسة دعم ملائمة ؛
تطوير وتعزيز أدوات و إجراءات الضبط ؛
دعم منتجي الثروة في الشعب ذات الأولوية ؛
تنمية قدرات تدخل المؤسسات العمومية والدواوين والتعاونيات الفلاحية في تنفيذ برامج التنمية و إجراءات الضبط.
قراءة أقل'''),
              ),
            ],
          ),
        ],
      ),
    );
  }
}
